[LANG]
language=Irish (Éire)
[FONT]
font-name=Segoe UI
welcome-text-size=62
home-text-size=22
home-section-size=24
analysis-text-size=20
analysis-section-size=22
left-panel-size=14
panel-list-size=16
panel-list-label-size=20
panel-list-header-size=16
panel-list-item-size=13
panel-button-size=12
combobox-size=16
list-combobox-size=16
checkbox-size=16
radio-size=15
elem-size=12
image-button-size=14
form-text-size=15
list-text-size=16
search-edit-size=16
message-text-size=16
setting-button-size=12
process-text-size=14
properites-title-font=18
properites-section-font=16
log-list-item-text-size=12
log-list-item-sql-size=14
[ERROR]
000000=
200001=Earráid chomhréire SQL
200002=Níl an comhad ann
200003=Tá an comhad truaillithe
200004=Earráid paraiméadair
200026=Ainm na tábla ann cheana
200027=Níl ainm na tábla ann
200028=Earráid agus comhad CSV á allmhairiú, theip ar an SQL a ghiniúint, seiceáil ábhar an chomhaid CSV agus an chumraíocht
300001=Níl aon cholún tábla roghnaithe chun innéacs a chruthú
300002=Ní féidir le ráiteas SQL a bheith folamh
300003=Ní thacaíonn anailís SQL ach le ceisteanna SELECT
[STRING]
home=Baile
database=Bunachar sonraí [citation:1]
analysis=Anailís
view=Amharc
setting=Socruithe [citation:1]
items=taifead
tables=Táblaí
views=Amharc
triggers=Truicear
columns=Colúin
indexes=Innéacsanna
table=Tábla
clear-all=Glan go léir
yes=Tá
no=Níl
welcome-text=Fáilte go CuteSqlite
home-text1=Is uirlis chliaint ghrafach (GUI) é CuteSqlite do Sqlite3.
home-text2=Ligeann sé duit bunachair shonraí a dhearadh, a chruthú agus a bhrabhsáil, réada bunachair shonraí a bhainistiú,
home-text3=agus sonraí a chur isteach chomh maith le ceisteanna SQL a dhearadh agus a rith chun na sonraí stóráilte a phróiseáil.
home-text4=Is féidir leat bunachar sonraí agus sonraí ó sholáthraithe bunachar sonraí eile a aistriú go bunachar sonraí Sqlite freisin.
db-section-text=Bunachar Sonraí Sqlite
analysis-text1=Ligeann CuteSqlite duit feidhmíocht ráiteas SQL a anailísiú agus a bharrfheabhsú.
analysis-text2=Agus ligeann sé duit freisin cumas stórála gach tábla sa bhunachar sonraí a anailísiú,
analysis-text3=chomh maith le paraiméadair bhunachar sonraí a chumrú chun an bunachar sonraí a bharrfheabhsú.
perf-analysis-section-text=Anailís Feidhmíochta
error-text=Earráid Córais:
create-database=Cruthaigh bunachar sonraí nua (Ctrl+N)
open-database=Oscail bunachar sonraí (Ctrl+O)
refresh-database=Athnuaigh bunachar sonraí (F5)
delete-database=Bain an bunachar sonraí roghnaithe ón liosta (Del)
override-user-db=Ní féidir sonraí an chomhaid scriosta a aisghabháil. Deimhnigh chun an bunachar sonraí a fhorscríobh?
create-db-success-text=Bunachar sonraí cruthaithe go rathúil
open-db-exists-inlist=Tá an bunachar sonraí oscailte cheana, ná déan an oibríocht arís
open-db-success-text=Bunachar sonraí oscailte go rathúil
delete-user-db=Deimhnigh chun an bunachar sonraí "{dbName}" a bhaint ón liosta?
delete-db-success-text=Bunachar sonraí bainte go rathúil ón liosta
query-editor=Eagarthóir Ceisteanna
history=Stair
history-tip=Stair (F8)
result-list=Torthaí
result-info=Eolas
result-table-data=Sonraí Tábla
table-properties=Airíonna Tábla
exec-select-sql=Cuir an cheist roghnaithe i gcrích (F9)
exec-all-sql=Cuir gach ceist i gcrích (F10)
explain-select-sql=Mínigh (Explain) an ráiteas SQL roghnaithe (F11)
explain-query-plan-sql=Mínigh plean ceiste (Explain query plan) an ráitis SQL roghnaithe (F12)
query-page-help=Feidhm uathchríochnaithe: [Tab]->an chéad chlib eile; [Ctrl+Spás]->liostaigh clibeanna meaitseála; [Ctrl+Iontráil]->liostaigh gach clib
no-select-userdb=Níl aon bhunachar sonraí roghnaithe
no-sql-statement=Níl aon ráiteas SQL san eagarthóir ceisteanna
no-sql-content=Níl aon ábhar SQL san eagarthóir ceisteanna
show-form-view=Taispeáin Amharc Foirme
export-result-as=Easpórtáil mar... (Ctrl+Alt+E)
copy-result-data=Cóipeáil sonraí go dtí an ghearrthaisce
clear-all=Glan go léir
ok=Ceart go leor
cancel=Cealaigh
export-text-description=Roghnaigh an fhormáid chun sonraí a easpórtáil
csv-settings=Roghanna CSV
csv-field-settings=Colúin
csv-line-settings=Rows
csv-charset-settings=Tacar Carachtar
excel-settings=Roghanna Excel
sql-settings=Roghanna SQL
export-fields-settings=Roghnaigh na colúin le heaspórtáil
terminated-by=Deighilteoir
enclosed-by=Iata ag
escaped-by=Carachtar éalaithe
field-terminated-by=Deighilteoir colúin
field-enclosed-by=Colún iata ag
field-escaped-by=Carachtar éalaithe colúin
line-terminated-by=Deighilteoir líne
add-column-name=Cuir ainmneacha colún sa cheanntásc
csv-charset=Tacar Carachtar
excel-column-max-size=Teorainn méide le haghaidh colún téacs
excel-decinmal-places=Iontaid dheachúlacha
structure-only=Struchtúr amháin
data-only=Sonraí amháin
structure-and-data=Struchtúr agus sonraí
select-all=Roghnaigh Uile
deselect-all=Díroghnaigh Uile
save-to-file=Sábháil go comhad
expert-fmt-error=Roghnaigh formáid comhaid chun sonraí a easpórtáil
terminated-by-error=Iontráil an luach don "Deighilteoir"
enclosed-by-error=Iontráil an luach don "Iata ag"
escaped-by-error=Iontráil an luach don "Carachtar éalaithe"
line-terminated-by-error=Tá luach an "Deighilteoir líne" mícheart
excel-column-max-size-error=Iontráil an luach don "Teorainn méide le haghaidh colún téacs"
excel-decinmal-places-error=Iontráil an luach do "Iontaid dheachúlacha"
export-sql-error=Roghnaigh na roghanna SQL
selected-fields-error=Roghnaigh na colúin le heaspórtáil
export-path-error=Iontráil cosán an chomhaid easpórtála
sql-notsupport-multitable-query-error=Ní thacaítear le torthaí ó cheisteanna il-táblaí agus fo-cheisteanna a easpórtáil
export-success-text=D'éirigh le heaspórtáil, easpórtáladh {rows} líne sonraí. Oscail comhad?
open-the-file=Oscail comhad
export-file-exists-prompt=Tá {export-path} ann cheana. Cuir ina áit?
limit-rows=Teorainn línte
offset=Tosú líne
rows=Líon línte
copy-all-rows-to-clipboard=Cóipeáil gach líne go dtí an ghearrthaisce	Ctrl+Alt+A
copy-sel-rows-to-clipboard=Cóipeáil línte roghnaithe go dtí an ghearrthaisce	Ctrl+Alt+H
copy-all-rows-as-sql=Cóipeáil gach líne mar SQL	Ctrl+Alt+J
copy-sel-rows-as-sql=Cóipeáil línte roghnaithe mar SQL	Ctrl+Alt+K
read-only=Léamh amháin
filter=Scagaire (Ctrl+Alt+F)
filter-in-use=Scagaire in úsáid
refresh=Athnuaigh (Ctrl+F5)
refresh-page=Athnuaigh
new-row-tip=Líne nua (Ctrl+Alt+N)
copy-row-tip=Cóipeáil líne (Ctrl+Alt+C)
save-tip=Sábháil (Ctrl+Alt+S)
delete-tip=Scrios líne roghnaithe (Ctrl+Del)
cancel-tip=Cealaigh athruithe (Ctrl+Alt+Z)
revert-tip=Cuir ar ais
save=Sábháil
revert=Cealaigh athruithe
column=Ainm colúin
condition=Coinníoll
value=Luach
delete-confirm-text=Deimhnigh chun na línte roghnaithe a scriosadh?
query=Ceist
result=Toradh
affected-rows=Línte lena mbaineann
exec-time=Am feidhmiúcháin
transfer-time=Am aistrithe
total-time=Am iomlán
database-create=Cruthaigh BS		Ctrl+N
database-open=Oscail BS		Ctrl+O
database-refresh=Athnuaigh BS		Ctrl+R
database-delete=Scrios BS		Del
database-copy=Cóipeáil BS mar...	Ctrl+P
database-export-as-sql=Easpórtáil BS go SQL	Ctrl+E
database-import-from-sql=Iompórtáil SQL go BS	Ctrl+I
database-new=Cruthaigh
database-new-table=Tábla
database-new-view=Amharc
database-new-trigger=Truicear
export-as-sql-text-description=Easpórtáil táblaí/amharc/thruicear an bhunachair shonraí roghnaithe mar SQL
select-database=Bunachar sonraí roghnaithe
database-objects=Réada
structure-and-data-settings=Socruithe struchtúir agus sonraí
insert-statement-settings=Socruithe ráitis INSERT
tbl-statement-settings=Socruithe ráitis tábla
retain-column-text=Coinnigh ainmneacha colún san "Insert Into"
contain-multi-rows-text=Tá il-línte i ngach ráiteas "Insert" (VALUES)
retain-table-text=Coinnigh an sean-tábla (Create Table If Not Exists ...)
override-table-text=Forscríobh an sean-tábla (DROP TABLE, ansin CREATE TABLE)
import-from-sql-text-description=Cuir ráitis i gcomhad i gcrích i mbaisceanna.
abort-on-error-text=Stop má bhíonn earráid ann.
import-file-not-exists=Níl an comhad SQL le hiompórtáil ann, roghnaigh arís.
import-path-empty-error=Ní féidir cosán an chomhaid iompórtála a bheith folamh.
import=Iompórtáil
export=Easpórtáil
tbl-name=Ainm an tábla
new-table=Cruthaigh tábla
new-view=Cruthaigh amharc
new-trigger=Cruthaigh truicear
database=Bunachar sonraí [citation:1]
schema=Scéim
table-columns=Colúin
table-indexes=Innéacsanna
table-foreignkeys=Eochracha Eachtracha
column-name=Ainm colúin
data-type=Cineál sonraí
default=Ábhar
check=Seiceáil
index-name=Ainm innéacs
index-type=Cineál innéacs
index-unique=Uathúil
partial-clause=Clásal páirteach
comments=Nótaí tráchta
to-be-selected=Colúin ar fáil
selected=Roghnaithe
up=▲
down=▼
no-columns-selected=Níl aon cholún roghnaithe, roghnaigh le do thoil
sql-preview=Réamhamharc SQL
tbl-name-empty=Ní féidir le hainm an tábla a bheith folamh
tbl-name-duplicated=Tá ainm an tábla ann cheana
create-table-success-text=Tábla cruthaithe go rathúil.
alter-table-success-text=Tábla athraithe go rathúil.
rename-table-success-text=Ainm an tábla athraithe go rathúil.
delete-column-confirm-text=Tagraíonn innéacs amháin nó níos mó don cholún roghnaithe. Má scriostar an colún seo, athrófar na hinnéacsanna comhfhreagracha freisin. Deimhnigh chun leanúint ar aghaidh leis an scriosadh?
delete-index-confirm-text=Tagraíonn colún amháin nó níos mó don innéacs roghnaithe. Má scriostar an t-innéacs seo, athrófar na colúin chomhfhreagracha freisin. Deimhnigh chun leanúint ar aghaidh leis an scriosadh?
delete-confirm-text=Deimhnigh chun leanúint ar aghaidh leis an scriosadh?
new-view=Cruthaigh amharc
new-trigger=Cruthaigh truicear
create-a-view-name=Ainm an amhairc nua
view-name-not-empty=Ní féidir le hainm an amhairc nua a bheith folamh
view-name-duplicated=Tá ainm an amhairc ann cheana
create-a-trigger-name=Ainm an truicear
trigger-name-not-empty=Ní féidir le hainm an truicear a bheith folamh
trigger-name-duplicated=Tá ainm an truicear ann cheana
execute-sql-success=SQL curtha i gcrích go rathúil
copy-db-success-text=Bunachar sonraí cóipeáilte go rathúil
table-open=Oscail sonraí tábla		Alt+O
table-create=Cruthaigh tábla		Alt+N
table-alter=Athraigh tábla		Alt+A
table-rename=Athainmnigh tábla		Alt+M
table-truncate=Folmhaigh tábla		Alt+T
table-drop=Scrios tábla		Alt+Del
table-copy-as=Cóipeáil tábla go dtí...		Alt+P
table-sharding-as=Sceallóga		Alt+G
table-export=Easpórtáil tábla go dtí...	Alt+E
table-import-sql=Iompórtáil ó chomhad SQL	Alt+I
table-import-csv=Iompórtáil ó chomhad CSV	Alt+J
table-manage-index=Bainistigh innéacsanna tábla
table-manage-foreign-key=Bainistigh eochracha eachtracha tábla
properties=Airíonna
primary-key-duplicated=Eochair phríomha sainithe níos mó ná uair amháin.
foreignkey-name=Ainm na heochrach eachtraí
referencing-columns=Colúin sa tábla seo
referenced-table=Tábla tagartha
referenced-columns=Colúin tagartha
on-update=Ar nuashonrú
on-delete=Ar scriosadh
insert-new-column=Cuir colún nua leis
insert-new-index=Cuir innéacs nua leis
insert-new-foreignkey=Cuir eochair eachtrach nua leis
insert-del-column=Scrios an colún roghnaithe
insert-del-index=Scrios an t-innéacs roghnaithe
insert-del-foreignkey=Scrios an eochair eachtrach roghnaithe
select-referenced-table-first=Roghnaigh an tábla tagartha ar dtús
new-table-name=Ainm nua an tábla
table-name-not-empty=Ní féidir le hainm nua an tábla a bheith folamh
table-name-duplicated=Tá ainm nua an tábla ann cheana
ai-column-exists=Tá colún AUTOINCREMENT ann cheana.
ai-fobidden-multi-pk=Tá colún AUTOINCREMENT ann cheana, ní cheadaítear ilcholúin eochrach príomha.
ai-column-must-integer=Caithfidh colún AUTOINCREMENT a bheith de chineál INTEGER.
truncate-table-confirm-text=Tar éis an tábla a fholmhú, ní féidir sonraí a aisghabháil. Deimhnigh chun folmhú?
truncate-table-success-text=Sonraí tábla folmhaithe go rathúil
drop-table-confirm-text=Tar éis an tábla a scriosadh, ní féidir sonraí a aisghabháil. Deimhnigh chun scriosadh?
drop-table-success-text=Tábla scriosta go rathúil
copy-table-text-description=Cumraigh paraiméadair chóipeála, tacaíonn sé le sceallóga tábla
from-db-name=Bunachar sonraí foinse
from-tbl-name=Tábla foinse
to-db-name=Bunachar sonraí sprice
to-tbl-name=Tábla sprice
table-sharding-setttings=Sceallóga tábla
enable-table-sharding=Cumasaigh sceallóga tábla
table-suffix-begin={suffix} Slánuimhir tosaigh
table-suffix-end={suffix} Slánuimhir deiridh
advanced-settings=Ardroghanna sceallóga
enable-copy-data-with-strategy=Cumasaigh straitéis chun sonraí a chóipeáil go táblaí sceallógacha
sharding-strategy-express-text=Slonn straitéise sceallóg: {n}
preview-sql=Réamhamharc ar ráiteas SQL
structure-and-data-settings-unknown=Níor roghnaíodh socruithe struchtúir agus sonraí
table-suffix-error=Slánuimhir sceallóg neamhbhailí, cuir isteach luach ceart
target-table-name-no-n=Caithfidh an tábla sprice an teaghrán "{n}" a bheith ann.
sharding-strategy-express-empty=Ní féidir le slonn straitéise sceallóg a bheith folamh
copy-table-success-text=Tábla cóipeáilte go rathúil.
start=Tosaigh
complete=Críochnaithe
express-title=Slonn straitéise sceallóg tábla
functions=Feidhmeanna
express-editor-help=Slonn - cliceáil faoi dhó ar fheidhm nó ar réimse chun é a chur isteach san eagarthóir
import-from-csv-text-description=Cumraíocht chun sonraí a iompórtáil ó chomhad CSV
source-csv-file=Cosán chomhaid CSV foinse
target-database=Bunachar sonraí sprice
target-table=Tábla sprice
columns-setttings=Colúin
csv-data=Sonraí CSV
column-name-on-top=An chéad líne mar ainmneacha colún
line-terminated-by=Deighilteoir líne
csv-null-as-keyword=null/NULL mar eochairfhocal SQL
encoding=Tacar Carachtar
import-success-text=D'éirigh le hiompórtáil
incorrect-sql-statement=Ráiteas SQL mícheart
import-error-text=Earráid iompórtála
table-manage-columns=Bainistigh colúin
table-drop-column=Scrios colún
table-manage-indexes=Bainistigh innéacsanna
table-drop-index=Scrios innéacs
create-view=Cruthaigh amharc nua
open-view=Oscail amharc
drop-view=Scrios amharc
create-trigger=Cruthaigh truicear
open-trigger=Oscail truicear
drop-trigger=Scrios truicear
drop-view-confirm-text=Tar éis an t-amharc a scriosadh, ní féidir é a aisghabháil. Deimhnigh chun scriosadh?
drop-view-success-text=Amharc scriosta go rathúil
drop-trigger-confirm-text=Tar éis an truicear a scriosadh, ní féidir é a aisghabháil. Deimhnigh chun scriosadh?
drop-trigger-success-text=Truicear scriosta go rathúil
sql-templates=Teimpléid ráitis SQL
pragma-templates=Pragmas
sql-log=Stair SQL
clear-all=Glan go léir
use=Úsáid
explain=Mínigh
top=Pionnaigh
untop=Díphionnaigh
copy=Cóipeáil
delete=Scrios
today=Inniu
yestoday=Inné
delete-sql-log-confirm-text=An bhfuil tú cinnte gur mhaith leat an loga SQL a scriosadh?
copy-to-clipboard=Cóipeáladh go dtí an ghearrthaisce
save-success-text=Sábháil rathúil
delete-success-text=Scriosadh rathúil
data-has-changed=Tá na sonraí athraithe. An bhfuil tú cinnte gur mhaith leat an leathanach a dhúnadh?
not-save-and-close=Ná sábháil, dún
cancel=Cealaigh dúnadh
table-export-as=Easpórtáil tábla sonraí	Alt+E
export-as-sql-success-text=D'éirigh le heaspórtáil. Oscail comhad?
new-query=Fuinneog nua ceiste (F7)
save-current=Sábháil reatha (Ctrl+S)
save-all=Sábháil uile (Ctrl+Shift+S)
first-page=An chéad leathanach
prev-page=Leathanach roimhe seo
next-page=An chéad leathanach eile
last-page=Leathanach deiridh
save-if-data-has-changed=Tá na sonraí athraithe. Sábháil roimh dhúnadh?
unsort=Cealaigh sórtáil
tab-close-this=Dún seo
tab-close-others=Dún cinn eile
tab-close-left=Dún gach ceann ar chlé
tab-close-right=Dún gach ceann ar dheis
perf-analysis=Anailís feidhmíochta
perf-analysis-reports=Tuarascálacha anailíse
store-analysis=Anailís stórála
db-params=Paraiméadair BS
not-select-sql=Ní thacaítear ach le ráitis SELECT
open-sql-log=Oscail loga SQL le haghaidh anailís feidhmíochta (Ctrl+L)
add-sql-analysis=Iontráil ráiteas SQL le haghaidh anailís feidhmíochta (Ctrl+I)
sql-log-not-found=Loga SQL gan aimsiú, seiceáil an bhfuil sé scriosta
original-sql=Ráiteas SQL bunaidh
where-clause-analysis=Anailís ar chlásal WHERE
order-clause-analysis=Anailís ar chlásal ORDER
covering-index-analysis=Anailís innéacs cumhdaigh
table-join-analysis=Anailís JOIN
in-table=Tábla sonraí
where-use-column=Úsáideann ráiteas WHERE colúin
order-use-column=Úsáideann ráiteas ORDER colúin
covering-index-column=Úsáideann ráitis WHERE agus ORDER colúin
where-use-index=Úsáideann ráiteas WHERE innéacs
order-use-index=Úsáideann ráiteas ORDER innéacs
use-covering-index=Úsáideann innéacs cumhdaigh
create-index-for-performance=Moladh: cruthaigh innéacs do na colúin seo a leanas chun feidhmíocht ceisteanna a fheabhsú
hint-index-for-performance=Leid: clúdaíonn innéacs {hintIndexName} na colúin cheana: {hintIndexColumns}
create-covering-index-for-performance=Moladh: cruthaigh innéacs cumhdaigh do na colúin seo a leanas chun feidhmíocht ceisteanna a fheabhsú
create-index-togeger=Cruthaigh innéacs (le chéile)
create-index-individ=Cruthaigh innéacsanna (ar leithligh)
create-covering-index=Cruthaigh innéacs cumhdaigh
explain-query-plan=Mínigh Plean Ceiste
query-optimizer-pseudocode=Taispeánann an pseudachód thíos próiseas feidhmiúcháin an bharrfheabsaitheora ceisteanna
cycle-count=Staidrimh thimthrialla
optimize-cycle-count=Leid: má athraítear ord JOIN na dtáblaí, is féidir an líon timthriallta a bharrfheabhsú agus a laghdú.
general-settings=Socruithe ginearálta
about=Maidir le
language-setting=Socrú teanga comhéadain
change-language-restart-text=Chun an teanga a athrú, ní mór an bogearra seo a atosú.
close-and-restart=Dún agus atosaigh
do-not-restart=Ná atosaigh
about-us=Fúinn
about-us-description=Bogearraí foinse oscailte is ea CuteSqlite arna fhorbairt ag an údar Xuehan Qin. [citation:1]
version-info=Leagan
version-info-description=CuteSqlite v0.2.2 béite (64-giotán)
feedback=Aiseolas
feedback-description=Má tá fadhbanna bogearraí agat, nó má tá smaointe agus moltaí agat don fheidhmchlár seo, líon isteach an fhoirm thíos le haiseolas a thabhairt dúinn.
content-text=Ábhar
license=Ceadúnas Apache Leagan 2.0
select-columns-analysis=Anailís ar cholúin SELECT
select-use-column=Úsáideann ráiteas SELECT na colúin seo a leanas
select-use-column-count=Líon na gcolún
select-use-column-advice=Moladh: roghnaíonn ráiteas SELECT níos mó ná {maxColumns} colún. Trí líon na gcolún a laghdú, is féidir feidhmíocht ceisteanna a fheabhsú.
select-use-column-tips=Leid: trí líon na gcolún a laghdú, is féidir feidhmíocht ceisteanna a fheabhsú.
sql-perf-report-prefix=tuarascáil-fheidhmíochta-sql-
store-analysis-prefix=Anailís stórála:
analysis-sql=Anailís SQL
open-perf-report=Oscail tuarascáil		Alt+O
drop-perf-report=Scrios tuarascáil		Alt+Del
drop-perf-report-confirm-text=Deimhnigh chun an tuarascáil a scriosadh?
store-analysis-text=Ligeann sé duit cumas stórála an bhunachair shonraí, na dtáblaí sonraí, agus innéacsanna táblaí a anailísiú
table-store-analysis=Tábla - {tblName}
index-store-analysis=Innéacs - {idxName} - Tábla: {tblName}
db-disk-used-title=Tuarascáil ar úsáid spáis diosca, cosán BS: {dbPath}
page-size-text=Méid leathanaigh (bearta)
page-size-tips=Méid leathanaigh (bearta)
file-bytes-text=Méid comhaid (bearta)
file-bytes-tips=Méid comhaid (bearta)
file-pgcnt-text=Líon leathanach sa chomhad iomlán (tomhaiste)
file-pgcnt-tips=Líon leathanach sa chomhad iomlán (tomhaiste)
file-pgcnt2-text=Líon leathanach sa chomhad iomlán (ríofa)
file-pgcnt2-tips=Líon leathanach sa chomhad iomlán (ríofa)
inuse-pgcnt-text=Líon leathanach a stórálann sonraí (úsáidte)
inuse-pgcnt-tips=Líon leathanach a stórálann sonraí (úsáidte)
free-pgcnt2-text=Líon leathanach gan sonraí (in aghaidh an chinn)
free-pgcnt2-tips=Líon leathanach gan sonraí (in aghaidh an chinn)
free-pgcnt-text=Líon leathanach gan sonraí (ríofa)
free-pgcnt-tips=Líon leathanach gan sonraí (ríofa)
av-pgcnt-text=Líon leathanach fholamhaithe go huathoibríoch
av-pgcnt-tips=Líon leathanach fholamhaithe go huathoibríoch
ntable-text=Líon táblaí sa bhunachar sonraí
ntable-tips=Líon táblaí sa bhunachar sonraí
nindex-text=Líon innéacsanna
nindex-tips=Líon innéacsanna
nmanindex-text=Líon innéacsanna sainithe
nmanindex-tips=Líon innéacsanna sainithe
nautoindex-text=Líon innéacsanna intuigthe (innéacsanna uath-incriminte)
nautoindex-tips=Líon innéacsanna intuigthe (innéacsanna uath-incriminte)
user-payload-text=Bearta d'ualaigh úsáideora stóráilte
user-payload-tips=Bearta d'ualaigh úsáideora stóráilte
all-tbl-entrycnt-title=Sonraí iomlána gach tábla (líon taifead)
all-tbl-idx-pagecnt-title=Líon leathanach gach tábla agus a n-innéacsanna
sperate-tbl-idx-pagecnt-title=Leathanaigh gach tábla agus innéacs ríofa ar leithligh
all-tbl-idx-report-title=Gach tábla agus innéacs
total-pages-percent-text=Céatadán de leathanaigh iomlána an bhunachair shonraí
total-pages-percent-tips=Céatadán de leathanaigh iomlána an bhunachair shonraí
nentry-text=Méid sonraí (líon taifead)
nentry-tips=Méid sonraí (líon taifead)
storage-text=Bearta stórála úsáidte
storage-tips=Bearta stórála úsáidte
compressed-size-text=Bearta úsáidte tar éis comhbhrú
compressed-size-tips=Bearta úsáidte tar éis comhbhrú
payload-text=Bearta úalaigh
payload-tips=Bearta úalaigh
total-meta-text=Bearta meiteashonraí
total-meta-tips=Bearta meiteashonraí
depth-text=Doimhneacht an chrainn B
depth-tips=Doimhneacht an chrainn B
avg-payload-text=Meán-ualach in aghaidh an taifid
avg-payload-tips=Meán-ualach in aghaidh an taifid
avg-unused-text=Meán na mbeart neamhúsáidte in aghaidh an taifid
avg-unused-tips=Meán na mbeart neamhúsáidte in aghaidh an taifid
avg-meta-text=Meán-mheiteashonraí in aghaidh an taifid
avg-meta-tips=Meán-mheiteashonraí in aghaidh an taifid
avg-fanout-text=Meán-fanout
avg-fanout-tips=Meán-fanout
gap-cnt-text=Leathanaigh neamh-chomhtheagmhálacha
gap-cnt-tips=Leathanaigh neamh-chomhtheagmhálacha
mx-payload-text=Ualach uasta in aghaidh an taifid
mx-payload-tips=Ualach uasta in aghaidh an taifid
ovfl-cnt-text=Líon na dtaifead thar maoil úsáidte
ovfl-cnt-tips=Líon na dtaifead thar maoil úsáidte
int-pages-text=Líon leathanach innéacs úsáidte
int-pages-tips=Líon leathanach innéacs úsáidte
leaf-pages-text=Líon leathanach duille úsáidte
leaf-pages-tips=Líon leathanach duille úsáidte
ovfl-pages-text=Líon leathanach thar maoil úsáidte
ovfl-pages-tips=Líon leathanach thar maoil úsáidte
total-pages-text=Líon iomlán leathanach úsáidte
total-pages-tips=Líon iomlán leathanach úsáidte
int-unused-text=Bearta neamhúsáidte ar leathanaigh innéacs
int-unused-tips=Bearta neamhúsáidte ar leathanaigh innéacs
leaf-unused-text=Bearta neamhúsáidte ar leathanaigh duille
leaf-unused-tips=Bearta neamhúsáidte ar leathanaigh duille
ovfl-unused-text=Bearta neamhúsáidte ar leathanaigh thar maoil
ovfl-unused-tips=Bearta neamhúsáidte ar leathanaigh thar maoil
total-unused-text=Bearta neamhúsáidte ar gach leathanach
total-unused-tips=Bearta neamhúsáidte ar gach leathanach
all-table-report-title=Gach tábla (innéacsanna eisiata)
all-indices-report-title=Gach innéacs (táblaí eisiata)
tbl-and-all-idx-report-title=Tábla {tblName} agus a innéacsanna go léir
tbl-only-report-title=Tábla {tblName} (innéacsanna ar bith eisiata)
idx-only-report-title=Innéacsanna go léir an tábla {tblName}
tbl-report-title=Tábla {tblName}
idx-report-title=Innéacs {idxName} an tábla {tblName}
props-tbl-only-report-title=Anailís stórála an tábla {tblName}
props-idx-props-only-report-title=Innéacsanna go léir an tábla {tblName}
db-pragma-params=Paraiméadair PRAGMA
db-quick-config-params=Roghanna mearchumraíochta
select-pragma=PRAGMA
pragma-analysis-limit-tips=Fiosraigh nó athraigh an teorainn do shocruithe anailíse (ANALYZE). Is é seo an líne meastachán a scrúdaíonn an t-ordú ANALYZE i ngach innéacs.
pragma-application-id-tips=Úsáidtear chun an tslánuimhir 32-giotán sínithe big-endian "Application ID" atá suite ag fritháireamh 68 i gceanntásc an bhunachair shonraí a fhiosrú nó a shocrú.
pragma-auto-vacuum-tips=Fiosraigh nó socraigh stádas uathfholamhaithe (auto-vacuum) sa bhunachar sonraí.
pragma-automatic-index-tips=Fiosraigh, cumasaigh, nó díchumasaigh an ghné uath-innéacsaithe.
pragma-busy-timeout-tips=Fiosraigh nó athraigh an socrú ama istigh gnóthaigh (busy timeout).
pragma-cache-size-tips=Fiosraigh nó athraigh an t-uasmhéid leathanach diosca bunachar sonraí a mholann SQLite a choinneáil i gcuimhne do gach comhad bunachar sonraí oscailte.
pragma-cache-spill-tips=Cumasaigh nó díchumasaigh cumas an chláir leathanaigh chun leathanaigh thruaillithe taisce a dhoirteadh go dtí an comhad bunachar sonraí i lár idirbhirt.
pragma-case-sensitive-like-tips=Dearmadann iompar réamhshocraithe an oibreora LIKE cás na n-aitreacha ASCII. Mar sin, de réir réamhshocraithe, tá 'a' LIKE 'A' fíor.
pragma-cell-size-check-tips=Cumasaigh nó díchumasaigh seiceálacha sláintíochta breise agus leathanaigh chrainn B an bhunachair shonraí á léamh ó dhiosca. Nuair a chumasaítear seiceáil mhéid na cille, is féidir truailliú bunachar sonraí a bhrath níos luaithe agus is lú an seans go "scaipfidh" sé.
pragma-checkpoint-fullfsync-tips=Fiosraigh nó athraigh an bhratach fullfsync d'oibríochtaí seicphointe. Má shocraítear an bhratach seo, úsáidfear an modh sioncronaithe F_FULLFSYNC le linn oibríochtaí seicphointe ar chórais a thacaíonn le F_FULLFSYNC. Is é OFF luach réamhshocraithe na brataí CHECKPOINT_FULLFSYNC. Ní thacaíonn ach Mac OS-X le F_FULLFSYNC.
pragma-collation-list-tips=Filleann sé liosta de sheichimh chóilínithe atá sainithe don nasc bunachar sonraí reatha.
pragma-compile-options-tips=Filleann sé ainmneacha na roghanna amach tiomsaithe a úsáideadh agus SQLite á thógáil, rogha amháin in aghaidh an tsraith.
pragma-count-changes-tips=Fiosraigh nó athraigh an bhratach comhairimh athruithe (count changes). De ghnáth, nuair nach bhfuil an bhratach count-changes socraithe, ní fhilleann ráitis INSERT, UPDATE agus DELETE aon sonraí.
pragma-data-store-directory-tips=Fiosraigh nó athraigh luach na hathróige domhanda sqlite3_data_directory, a úsáideann inneall chúlchóras comhéadan córas oibriúcháin Windows chun suíomh na gcomhad bunachar sonraí a shonraítear le cosán coibhneasta a chinneadh.
pragma-data-version-tips=Léiríonn sé go bhfuil an comhad bunachar sonraí modhnaithe. Is féidir le cláir idirghníomhacha a choinníonn inneachar bunachar sonraí i gcuimhne nó a thaispeánann ar scáileán iad an t-ordú PRAGMA data_version a úsáid chun a chinneadh an gá dóibh cuimhne a athnuachan agus a athlódáil nó an taispeáint scáileáin a nuashonrú.
pragma-default-cache-size-tips=Fiosraigh nó socraigh an t-uasmhéid leathanach taisce diosca molta a leithdháilfear ar gach comhad bunachar sonraí oscailte.
pragma-defer-foreign-keys-tips=Treoraíonn sé go gcuirfear srianta uile na n-eochracha eachtracha ar athló go dtí go ndéanfar an t-idirbheart is forimeallaí a thiomnú.
pragma-empty-result-callbacks-tips=Fiosraigh nó athraigh an bhratach glaoch ar ais le haghaidh toraidh fholmh.
pragma-encoding-tips=An ionchódú téacs a úsáideann an príomh-bhunachar sonraí: 'UTF-8', 'UTF-16le' (UTF-16 little-endian), nó 'UTF-16be' (UTF-16 big-endian).
pragma-foreign-key-check-tips=Seiceálann sé an bunachar sonraí nó an tábla le haghaidh sáruithe ar shrianta eochrach eachtrach.
pragma-foreign-keys-tips=Fiosraigh, cumasaigh, nó díchumasaigh forfheidhmiú srianta eochrach eachtrach.
pragma-freelist-count-tips=Filleann sé líon na leathanach neamhúsáidte sa chomhad bunachar sonraí.
pragma-full-column-names-tips=Fiosraigh nó athraigh an bhratach full_column_names.
pragma-fullfsync-tips=Fiosraigh nó athraigh an bhratach fullfsync. Cinneann an bhratach seo an n-úsáidfear an modh sioncronaithe F_FULLFSYNC ar chórais a thacaíonn leis. Is é OFF luach réamhshocraithe fullfsync. Ní thacaíonn ach Mac OS X le F_FULLFSYNC.
pragma-hard-heap-limit-tips=Cuireann sé teorainn le méid na cuimhne cnap (heap) do gach nasc bunachar sonraí in aon phróiseas amháin.
pragma-ignore-check-constraints-tips=Cumasaigh nó díchumasaigh forfheidhmiú srianta CHECK. Is é OFF an socrú réamhshocraithe, rud a chiallaíonn go bhforfheidhmítear srianta CHECK de réir réamhshocraithe.
pragma-incremental-vacuum-tips=Cuireann sé faoi deara go mbainfear suas le N leathanach den liosta saor (freelist).
pragma-integrity-check-tips=Déanann sé seiceáil formáidithe agus comhsheasmhachta ar leibhéal íseal ar an mbunachar sonraí.
pragma-journal-mode-tips=Fiosraigh nó socraigh an modh dialainne don bhunachar sonraí a bhaineann leis an nasc bunachar sonraí reatha.
pragma-journal-size-limit-tips=Cuireann sé teorainn le méid na ndialann rolladh ar ais (rollback journal) agus na gcomhad WAL a fhágtar sa chóras comhad tar éis idirbhirt nó seicphointe.
pragma-legacy-alter-table-tips=Socraigh nó fiosraigh luach na brataí legacy_alter_table.
pragma-locking-mode-tips=Socraigh nó fiosraigh mód glasála an naisc bhunachar sonraí. Is iad na módanna ná NORMAL nó EXCLUSIVE.
pragma-max-page-count-tips=Fiosraigh nó socraigh an t-uasmhéid leathanach sa chomhad bunachar sonraí.
pragma-mmap-size-tips=Fiosraigh nó athraigh an t-uasmhéid beart atá forchoimeádta d'I/O léarscáilithe cuimhne (memory-mapped I/O) ar bhunachar sonraí amháin.
pragma-module-list-tips=Filleann sé liosta de mhodúil fhíortháblaí atá cláraithe leis an nasc bunachar sonraí.
pragma-optimize-tips=Deanann sé iarracht an bunachar sonraí a bharrfheabhsú.
pragma-page-count-tips=Filleann sé líon iomlán na leathanach sa chomhad bunachar sonraí.
pragma-page-size-tips=Fiosraigh nó socraigh méid leathanaigh an bhunachair shonraí. Caithfidh méid an leathanaigh a bheith ina chumhacht de dhá idir 512 agus 65536.
pragma-parser-trace-tips=Cuireann sé rianú ar an bparsálaí SQL a úsáidtear go hinmheánach ag SQLite. Ní bhíonn éifeacht aige ach amháin nuair a chuirtear le chéile é le SQLITE_DEBUG.
pragma-query-only-tips=Cuireann sé cosc ar athruithe sonraí ar an gcomhad bunachar sonraí. Nuair a chumasaítear é, beidh earráid SQLITE_READONLY mar thoradh ar aon iarracht CREATE, UPDATE, DROP, INSERT nó UPDATE.
pragma-quick-check-tips=Déanann sé seiceáil formáidithe agus comhsheasmhachta ar leibhéal íseal ar an mbunachar sonraí, ag scipeáil seiceálacha comhsheasmhachta UNIQUE agus innéacs.
pragma-read-uncommitted-tips=Fiosraigh, cumasaigh, nó díchumasaigh an leithlisiú READ UNCOMMITTED.
pragma-recursive-triggers-tips=Fiosraigh, cumasaigh, nó díchumasaigh an cumas athchúrsach truicear.
pragma-reverse-unordered-selects-tips=Nuair a chumasaítear é, cuireann an PRAGMA seo faoi deara go bhfilleann go leor ráiteas SELECT gan chlásal ORDER BY torthaí in ord atá droim ar ais de ghnáth.
pragma-schema-version-tips=Faigheann nó socraíonn sé an tslánuimhir schema_version ag fritháireamh 40 i gceanntásc an bhunachair shonraí.
pragma-secure-delete-tips=Fiosraigh nó athraigh an socrú scriosta slán (secure-delete).
pragma-short-column-names-tips=Fiosraigh nó athraigh an bhratach gearr-ainmneacha colún.
pragma-soft-heap-limit-tips=Cuireann sé teorainn le méid na cuimhne cnap a úsáideann gach nasc bunachar sonraí in aon phróiseas amháin.
pragma-stats-tips=Filleann sé faisnéis chúnta faoi tháblaí agus innéacsanna.
pragma-synchronous-tips=Fiosraigh nó athraigh socrú na brataí "synchronous".
pragma-temp-store-tips=Fiosraigh nó athraigh luach na hathróige domhanda sqlite3_temp_directory, a úsáideann go leor innill chúlchórais chomhéadain chóras oibriúcháin chun a chinneadh cá háit a stórálfar táblaí agus innéacsanna sealadacha.
pragma-threads-tips=Líon na snáitheanna cúnta a thosaíonn ráiteas ullmhaithe (prepared statement) chun cabhrú leis an gceist.
pragma-trusted-schema-tips=Cibé an gceadaítear feidhmeanna SQL neamhshábháilte agus fíortháblaí a rith sa scéim. Cinneann sé cibé an gceadaítear d'amhairc, thruicear, nó slonn scéime (cosúil le srianta CHECK, clásail DEFAULT, colúin ghinte, innéacsanna slonn agus/nó innéacsanna páirteacha) feidhmeanna SQL neamhshábháilte agus fíortháblaí a rith.
pragma-user-version-tips=Faigheann nó socraíonn sé an tslánuimhir user_version ag fritháireamh 60 i gceanntásc an bhunachair shonraí.
pragma-vdbe-addoptrace-tips=Taispeántar oid-chóid iomlána VDBE le linn giniúna cód. Ar choinníoll go bhfuil SQLite curtha le chéile leis an rogha SQLITE_DEBUG agus go bhfuil vdbe_debug cumasaithe.
pragma-vdbe-debug-tips=Cuireann sé dífhabhtú VDBE ar siúl. Ar choinníoll go bhfuil SQLite curtha le chéile leis an rogha SQLITE_DEBUG.
pragma-vdbe-listing-tips=Taispeánann sé liostú iomlán d'oid-chóid an mheaisín fhíorúil ar aschur caighdeánach. Ar choinníoll go bhfuil SQLite curtha le chéile leis an rogha SQLITE_DEBUG agus go bhfuil vdbe_debug cumasaithe.
pragma-vdbe-trace-tips=Priontálann sé oid-chóid an mheaisín fhíorúil ar aschur caighdeánach le linn ríomha. Ar choinníoll go bhfuil SQLite curtha le chéile leis an rogha SQLITE_DEBUG agus go bhfuil vdbe_debug cumasaithe.
pragma-wal-autocheckpoint-tips=Fiosraigh nó socraigh an t-eatramh uathsheicphointe don loga scríobh-roimh ré (write-ahead log).
pragma-wal-checkpoint-tips=Cuireann sé faoi deara go n-aistreofar inneachar an loga scríobh-roimh ré do bhunachar sonraí X ar nasc bunachar sonraí D go dtí an comhad bunachar sonraí agus go n-athshocrófar an loga scríobh-roimh ré.
pragma-writable-schema-tips=Ceadaíonn sé don tábla sqlite_schema a athrú trí ghnáthráitis UPDATE, INSERT agus DELETE a úsáid. Rabhadh: is féidir le mí-úsáid an pragma seo truailliú comhaid bunachar sonraí a bheith mar thoradh go héasca.
pragma-save-confirm=Déanfaidh ráitis PRAGMA difear d'oibríocht an bhunachair shonraí. Deimhnigh chun an ráiteas seo a leanas a fheidhmiú?
confirm-exec-text=Deimhnigh & Feidhmigh